-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Ноя 24 2020 г., 05:47
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `web_site_db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `city`
--

CREATE TABLE `city` (
  `city_id` int(11) NOT NULL COMMENT 'id',
  `city_name` varchar(25) NOT NULL COMMENT 'город'
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COMMENT='Названия городов';

--
-- Дамп данных таблицы `city`
--

INSERT INTO `city` (`city_id`, `city_name`) VALUES
(1, 'Абакан'),
(2, 'Азов'),
(3, 'Александров'),
(4, 'Алексин'),
(5, 'Альметьевск'),
(6, 'Анапа'),
(7, 'Ангарск'),
(8, 'Анжеро - Судженск'),
(9, 'Апатиты'),
(10, 'Арзамас'),
(11, 'Армавир'),
(12, 'Арсеньев'),
(13, 'Артем'),
(14, 'Архангельск'),
(15, 'Асбест'),
(16, 'Астрахань'),
(17, 'Ачинск'),
(18, 'Балаково'),
(19, 'Балахна'),
(20, 'Балашиха'),
(21, 'Балашов'),
(22, 'Барнаул'),
(23, 'Батайск'),
(24, 'Белгород'),
(25, 'Белебей'),
(26, 'Белово'),
(27, 'Белогорск'),
(28, 'Белорецк'),
(29, 'Белореченск'),
(30, 'Бердск'),
(31, 'Березники'),
(32, 'Березовский'),
(33, 'Бийск'),
(34, 'Биробиджан'),
(35, 'Благовещенск'),
(36, 'Бор'),
(37, 'Борисоглебск'),
(38, 'Боровичи'),
(39, 'Братск'),
(40, 'Брянск'),
(41, 'Бугульма'),
(42, 'Буденновск'),
(43, 'Бузулук'),
(44, 'Буйнакск'),
(45, 'Великие Луки'),
(46, 'Великий Новгород'),
(47, 'Верхняя Пышма'),
(48, 'Видное'),
(49, 'Владивосток'),
(50, 'Владикавказ'),
(51, 'Владимир'),
(52, 'Волгоград'),
(53, 'Волгодонск'),
(54, 'Волжск'),
(55, 'Волжский'),
(56, 'Вологда'),
(57, 'Вольск'),
(58, 'Воркута'),
(59, 'Воронеж'),
(60, 'Воскресенск'),
(61, 'Воткинск'),
(62, 'Всеволожск'),
(63, 'Выборг'),
(64, 'Выкса'),
(65, 'Вязьма'),
(66, 'Гатчина'),
(67, 'Геленджик'),
(68, 'Георгиевск'),
(69, 'Глазов'),
(70, 'Горно - Алтайск'),
(71, 'Грозный'),
(72, 'Губкин'),
(73, 'Гудермес'),
(74, 'Гуково'),
(75, 'Гусь - Хрустальный'),
(76, 'Дербент'),
(77, 'Дзержинск'),
(78, 'Димитровград'),
(79, 'Дмитров'),
(80, 'Долгопрудный'),
(81, 'Домодедово'),
(82, 'Донской'),
(83, 'Дубна'),
(84, 'Евпатория'),
(85, 'Егорьевск'),
(86, 'Ейск'),
(87, 'Екатеринбург'),
(88, 'Елабуга'),
(89, 'Елец'),
(90, 'Ессентуки'),
(91, 'Железногорск'),
(92, 'Жигулевск'),
(93, 'Жуковский'),
(94, 'Заречный'),
(95, 'Зеленогорск'),
(96, 'Зеленодольск'),
(97, 'Златоуст'),
(98, 'Иваново'),
(99, 'Ивантеевка'),
(100, 'Ижевск'),
(101, 'Избербаш'),
(102, 'Иркутск'),
(103, 'Искитим'),
(104, 'Ишим'),
(105, 'Ишимбай'),
(106, 'Йошкар - Ола'),
(107, 'Казань'),
(108, 'Калининград'),
(109, 'Калуга'),
(110, 'Каменск - Уральский'),
(111, 'Каменск - Шахтинский'),
(112, 'Камышин'),
(113, 'Канск'),
(114, 'Каспийск'),
(115, 'Кемерово'),
(116, 'Керчь'),
(117, 'Кинешма'),
(118, 'Кириши'),
(119, 'Киров'),
(120, 'Кирово-Чепецк'),
(121, 'Киселевск'),
(122, 'Кисловодск'),
(123, 'Клин'),
(124, 'Клинцы'),
(125, 'Ковров'),
(126, 'Когалым'),
(127, 'Коломна'),
(128, 'Комсомольск - на - Амуре'),
(129, 'Копейск'),
(130, 'Королев'),
(131, 'Кострома'),
(132, 'Котлас'),
(133, 'Красногорск'),
(134, 'Краснодар'),
(135, 'Краснокаменск'),
(136, 'Краснокамск'),
(137, 'Краснотурьинск'),
(138, 'Красноярск'),
(139, 'Кропоткин'),
(140, 'Крымск'),
(141, 'Кстово'),
(142, 'Кузнецк'),
(143, 'Кумертау'),
(144, 'Кунгур'),
(145, 'Курган'),
(146, 'Курск'),
(147, 'Кызыл'),
(148, 'Лабинск'),
(149, 'Лениногорск'),
(150, 'Ленинск - Кузнецкий'),
(151, 'Лесосибирск'),
(152, 'Липецк'),
(153, 'Лиски'),
(154, 'Лобня'),
(155, 'Лысьва'),
(156, 'Лыткарино'),
(157, 'Люберцы'),
(158, 'Магадан'),
(159, 'Магнитогорск'),
(160, 'Майкоп'),
(161, 'Махачкала'),
(162, 'Междуреченск'),
(163, 'Мелеуз'),
(164, 'Миасс'),
(165, 'Минеральные Воды'),
(166, 'Минусинск'),
(167, 'Михайловка'),
(168, 'Михайловск'),
(169, 'Мичуринск'),
(170, 'Москва'),
(171, 'Мурманск'),
(172, 'Муром'),
(173, 'Мытищи'),
(174, 'Набережные Челны'),
(175, 'Назарово'),
(176, 'Назрань'),
(177, 'Нальчик'),
(178, 'Наро - Фоминск'),
(179, 'Находка'),
(180, 'Невинномысск'),
(181, 'Нерюнгри'),
(182, 'Нефтекамск'),
(183, 'Нефтеюганск'),
(184, 'Нижневартовск'),
(185, 'Нижнекамск'),
(186, 'Нижний Новгород'),
(187, 'Нижний Тагил'),
(188, 'Новоалтайск'),
(189, 'Новокузнецк'),
(190, 'Новокуйбышевск'),
(191, 'Новомосковск'),
(192, 'Новороссийск'),
(193, 'Новосибирск'),
(194, 'Новотроицк'),
(195, 'Новоуральск'),
(196, 'Новочебоксарск'),
(197, 'Новочеркасск'),
(198, 'Новошахтинск'),
(199, 'Новый Уренгой'),
(200, 'Ногинск'),
(201, 'Норильск'),
(202, 'Ноябрьск'),
(203, 'Нягань'),
(204, 'Обнинск'),
(205, 'Одинцово'),
(206, 'Озерск'),
(207, 'Октябрьский'),
(208, 'Омск'),
(209, 'Орел'),
(210, 'Оренбург'),
(211, 'Орск'),
(212, 'Павлово'),
(213, 'Павловский Посад'),
(214, 'Пенза'),
(215, 'Первоуральск'),
(216, 'Пермь'),
(217, 'Петрозаводск'),
(218, 'Петропавловск-Камчатский'),
(219, 'Подольск'),
(220, 'Полевской'),
(221, 'Прокопьевск'),
(222, 'Прохладный'),
(223, 'Псков'),
(224, 'Пушкино'),
(225, 'Пятигорск'),
(226, 'Раменское'),
(227, 'Ревда'),
(228, 'Реутов'),
(229, 'Ржев'),
(230, 'Рославль'),
(231, 'Россошь'),
(232, 'Ростов - на - Дону'),
(233, 'Рубцовск'),
(234, 'Рыбинск'),
(235, 'Рязань'),
(236, 'Салават'),
(237, 'Сальск'),
(238, 'Самара'),
(239, 'Санкт - Петербург'),
(240, 'Саранск'),
(241, 'Сарапул'),
(242, 'Саратов'),
(243, 'Саров'),
(244, 'Свободный'),
(245, 'Севастополь'),
(246, 'Северодвинск'),
(247, 'Северск'),
(248, 'Сергиев Посад'),
(249, 'Серов'),
(250, 'Серпухов'),
(251, 'Сертолово'),
(252, 'Сибай'),
(253, 'Симферополь'),
(254, 'Славянск - на - Кубани'),
(255, 'Смоленск'),
(256, 'Соликамск'),
(257, 'Солнечногорск'),
(258, 'Сосновый Бор'),
(259, 'Сочи'),
(260, 'Ставрополь'),
(261, 'Старый Оскол'),
(262, 'Стерлитамак'),
(263, 'Ступино'),
(264, 'Сургут'),
(265, 'Сызрань'),
(266, 'Сыктывкар'),
(267, 'Таганрог'),
(268, 'Тамбов'),
(269, 'Тверь'),
(270, 'Тимашевск'),
(271, 'Тихвин'),
(272, 'Тихорецк'),
(273, 'Тобольск'),
(274, 'Тольятти'),
(275, 'Томск'),
(276, 'Троицк'),
(277, 'Туапсе'),
(278, 'Туймазы'),
(279, 'Тула'),
(280, 'Тюмень'),
(281, 'Узловая'),
(282, 'Улан - Удэ'),
(283, 'Ульяновск'),
(284, 'Урус-Мартан'),
(285, 'Усолье-Сибирское'),
(286, 'Уссурийск'),
(287, 'Усть - Илимск'),
(288, 'Уфа'),
(289, 'Ухта'),
(290, 'Феодосия'),
(291, 'Фрязино'),
(292, 'Хабаровск'),
(293, 'Ханты-Мансийск'),
(294, 'Хасавюрт'),
(295, 'Химки'),
(296, 'Чайковский'),
(297, 'Чапаевск'),
(298, 'Чебоксары'),
(299, 'Челябинск'),
(300, 'Черемхово'),
(301, 'Череповец'),
(302, 'Черкесск'),
(303, 'Черногорск'),
(304, 'Чехов'),
(305, 'Чистополь'),
(306, 'Чита'),
(307, 'Шадринск'),
(308, 'Шали'),
(309, 'Шахты'),
(310, 'Шуя'),
(311, 'Щекино'),
(312, 'Щелково'),
(313, 'Электросталь'),
(314, 'Элиста'),
(315, 'Энгельс'),
(316, 'Южно-Сахалинск'),
(317, 'Юрга'),
(318, 'Якутск'),
(319, 'Ялта'),
(320, 'Ярославль');

-- --------------------------------------------------------

--
-- Структура таблицы `fio`
--

CREATE TABLE `fio` (
  `fio_id` int(11) NOT NULL COMMENT 'ид',
  `fio_family` varchar(25) NOT NULL COMMENT 'фамилия',
  `fio_name` varchar(15) NOT NULL COMMENT 'имя',
  `fio_name2` varchar(15) NOT NULL COMMENT 'отчество',
  `fio_date` date NOT NULL COMMENT 'дата рождения',
  `fio_gen` tinyint(1) NOT NULL DEFAULT 1 COMMENT 'пол',
  `city_id` int(11) NOT NULL COMMENT 'город_ид',
  `fio_mail` varchar(35) NOT NULL COMMENT 'эл почта',
  `fio_phone` varchar(16) NOT NULL COMMENT 'телефон',
  `fio_text` text NOT NULL COMMENT 'о себе'
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COMMENT='ФИО ';

-- --------------------------------------------------------

--
-- Структура таблицы `opit`
--

CREATE TABLE `opit` (
  `opit_id` int(10) NOT NULL COMMENT 'id opit',
  `rez_id` int(11) NOT NULL COMMENT 'ид резюме',
  `opit_date_start` date NOT NULL COMMENT 'дата начало',
  `opit_date_end` date NOT NULL COMMENT 'дата конец если есть',
  `opit_org` varchar(100) NOT NULL COMMENT 'организация',
  `opit_dolzhn` varchar(50) NOT NULL COMMENT 'должность',
  `opit_func` text NOT NULL COMMENT 'функция'
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COMMENT='опыт работы';

-- --------------------------------------------------------

--
-- Структура таблицы `rez`
--

CREATE TABLE `rez` (
  `rez_id` int(11) NOT NULL COMMENT 'ид резюме',
  `fio_id` int(11) NOT NULL,
  `spec_id` int(11) NOT NULL COMMENT 'ид специализации',
  `rez_price` int(10) NOT NULL COMMENT 'зарплата',
  `rez_busy_f` tinyint(1) DEFAULT 0 COMMENT 'занятость полная',
  `rez_busy_c` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'занятость частичная',
  `rez_busy_p` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'занятость проектная',
  `rez_busy_v` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'занятость волонтерская',
  `rez_busy_s` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'занятость стажировка',
  `rez_graf_f` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'график полный день',
  `rez_graf_s` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'график сменный',
  `rez_graf_g` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'график гибкий',
  `rez_graf_u` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'график удаленный',
  `rez_graf_v` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'график вахта',
  `opit` tinyint(1) DEFAULT 0 COMMENT 'опыт если есть'
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COMMENT='Резюме';

-- --------------------------------------------------------

--
-- Структура таблицы `spec`
--

CREATE TABLE `spec` (
  `spec_id` int(3) NOT NULL COMMENT 'id',
  `spec_name` varchar(50) NOT NULL COMMENT 'специализация'
) ENGINE=InnoDB DEFAULT CHARSET=cp1251 COMMENT='специализация';

--
-- Дамп данных таблицы `spec`
--

INSERT INTO `spec` (`spec_id`, `spec_name`) VALUES
(53, 'Администратор баз данных'),
(54, 'Аналитик'),
(55, 'Арт-директор'),
(56, 'Инженер'),
(57, 'Компьютерная безопасность'),
(58, 'Контент'),
(59, 'Маркетинг'),
(60, 'Мультимедиа'),
(61, 'Оптимизация сайта (SEO)'),
(62, 'Передача данных и доступ в интернет'),
(63, 'Программирование, Разработка'),
(64, 'Продажи'),
(65, 'Продюсер'),
(66, 'Развитие бизнеса'),
(67, 'Системный администратор'),
(68, 'Системы управления предприятием (ERP)'),
(69, 'Сотовые, Беспроводные технологии'),
(70, 'Стартапы'),
(71, 'Телекоммуникации'),
(72, 'Тестирование'),
(73, 'Технический писатель'),
(74, 'Управление проектами'),
(75, 'Электронная коммерция'),
(76, 'CRM системы'),
(77, 'Web инженер'),
(78, 'Web мастер');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `city`
--
ALTER TABLE `city`
  ADD PRIMARY KEY (`city_id`);

--
-- Индексы таблицы `fio`
--
ALTER TABLE `fio`
  ADD PRIMARY KEY (`fio_id`),
  ADD KEY `city_id` (`city_id`);

--
-- Индексы таблицы `opit`
--
ALTER TABLE `opit`
  ADD PRIMARY KEY (`opit_id`),
  ADD KEY `opit_ibfk_1` (`rez_id`);

--
-- Индексы таблицы `rez`
--
ALTER TABLE `rez`
  ADD PRIMARY KEY (`rez_id`),
  ADD KEY `spec_id` (`spec_id`),
  ADD KEY `fio_id` (`fio_id`);

--
-- Индексы таблицы `spec`
--
ALTER TABLE `spec`
  ADD PRIMARY KEY (`spec_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `city`
--
ALTER TABLE `city`
  MODIFY `city_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id', AUTO_INCREMENT=321;

--
-- AUTO_INCREMENT для таблицы `fio`
--
ALTER TABLE `fio`
  MODIFY `fio_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ид';

--
-- AUTO_INCREMENT для таблицы `opit`
--
ALTER TABLE `opit`
  MODIFY `opit_id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id opit';

--
-- AUTO_INCREMENT для таблицы `rez`
--
ALTER TABLE `rez`
  MODIFY `rez_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ид резюме';

--
-- AUTO_INCREMENT для таблицы `spec`
--
ALTER TABLE `spec`
  MODIFY `spec_id` int(3) NOT NULL AUTO_INCREMENT COMMENT 'id', AUTO_INCREMENT=79;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `fio`
--
ALTER TABLE `fio`
  ADD CONSTRAINT `fio_ibfk_1` FOREIGN KEY (`city_id`) REFERENCES `city` (`city_id`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Ограничения внешнего ключа таблицы `opit`
--
ALTER TABLE `opit`
  ADD CONSTRAINT `opit_ibfk_1` FOREIGN KEY (`rez_id`) REFERENCES `rez` (`rez_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `rez`
--
ALTER TABLE `rez`
  ADD CONSTRAINT `rez_ibfk_1` FOREIGN KEY (`spec_id`) REFERENCES `spec` (`spec_id`),
  ADD CONSTRAINT `rez_ibfk_2` FOREIGN KEY (`fio_id`) REFERENCES `fio` (`fio_id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
